espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/cli/core-cli.c
/***************************************************************************//**
 * @file
 * @brief Core CLI commands used by all applications regardless of profile.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#ifdef UC_BUILD

#include "sl_component_catalog.h"
#include "app/framework/include/af.h"
#include "app/framework/util/common.h"
#include "app/framework/util/af-main.h"
#include "app/util/serial/sl_zigbee_command_interpreter.h"
#include "sl_component_catalog.h"
#include "library.h"
#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT
#include "rail_ieee802154.h"
#endif
#ifdef EMBER_AF_HAS_SECURITY_PROFILE_SE
  #include "stack/include/cbke-crypto-engine.h"  // emberGetCertificate()
#endif

#ifdef SL_CATALOG_KERNEL_PRESENT
#include "cmsis_os2.h"
#include "sl_cmsis_os2_common.h"
#endif //#ifdef SL_CATALOG_KERNEL_PRESENT

extern uint8_t emAfCliNetworkIndex;

#ifdef SL_CATALOG_RAIL_UTIL_IEEE802154_PHY_SELECT_PRESENT
void  sli_get_pti_radio_config(sl_cli_command_arg_t *arguments)
{
  (void) emberSerialPrintfLine(APP_SERIAL, "Current Config: %0x", RAIL_IEEE802154_GetPtiRadioConfig(emberGetRailHandle()));
}

#endif

void sli_zigbee_cli_config_cca_mode_command(sl_cli_command_arg_t *arguments)
{
  uint8_t ccaMode = sl_cli_get_argument_uint8(arguments, 0);
  EmberStatus status = emberSetRadioIeee802154CcaMode(ccaMode);
  (void)emberSerialPrintfLine(APP_SERIAL, "Set CCA mode to %d: %0x",
                              ccaMode,
                              status);
}

void sli_cli_pre_cmd_hook(sl_cli_command_arg_t* arguments)
{
  (void)arguments;
  emberAfPushNetworkIndex(emAfCliNetworkIndex);

#if defined(SL_CATALOG_BLUETOOTH_PRESENT)
  //Do not lock/unlock kernel for BLE commands
  uint8_t cmd_count = sl_cli_get_command_count(arguments);
  if (cmd_count >= 2) {
    char *cmd1_ptr = sl_cli_get_command_string(arguments, 0);
    char *cmd2_ptr =  sl_cli_get_command_string(arguments, 1);
    // condition below should be true for any cli that starts with plug ble
    // strncmp returns 0 when the comparison results in a match
    if ( (strncmp(cmd1_ptr, "plug", 4) == 0) && (strncmp(cmd2_ptr, "ble", 3) == 0) ) {
      return;
    }
  }
#endif //#if defined(SL_CATALOG_BLUETOOTH_PRESENT)

  // Lock OS kernel to prevent CLI task from calling ember functions
  // CLI task is lower priority than zigbee and can be preempted
  #if defined(SL_CATALOG_KERNEL_PRESENT)
  (void)osKernelLock();
  #endif //#if defined(SL_CATALOG_KERNEL_PRESENT)
}

void sli_cli_post_cmd_hook(sl_cli_command_arg_t* arguments)
{
  (void)arguments;

  emberAfPopNetworkIndex();

#if defined(EMBER_QA)
  (void) emberSerialPrintfLine(APP_SERIAL, "CLI Finished");
#endif

#ifdef SL_CATALOG_KERNEL_PRESENT
  (void)osKernelUnlock();
#endif //#ifdef SL_CATALOG_KERNEL_PRESENT

#ifdef SL_CATALOG_KERNEL_PRESENT
  // After every CLI command we wake up the ZigBee task so that it can be
  // processed in a timely fashion.
  sl_zigbee_common_rtos_wakeup_stack_task();
#endif // SL_CATALOG_KERNEL_PRESENT
}

static void printMfgString(void)
{
  uint8_t mfgString[MFG_STRING_MAX_LENGTH + 1];
  emberAfFormatMfgString(mfgString);

  // Note: We use '%s' here because this is a RAM string. Normally,
  // most strings are literals or constants in flash and use '%p'.
  sl_zigbee_core_debug_print("MFG String: %s", mfgString);
}

static void printPacketBuffers(void)
{
  sl_zigbee_core_debug_print("Buffs: %d / %d\n",
                             emAfGetPacketBufferFreeCount(),
                             emAfGetPacketBufferTotalCount());
}

static bool printSmartEnergySecurityInfo(void)
{
#ifdef EMBER_AF_HAS_SECURITY_PROFILE_SE
  bool securityGood = true;
  sl_zigbee_core_debug_print("SE Security Info [");
  {
    // For SE security, print the state of ECC, CBKE, and the programmed Cert.
    EmberCertificateData cert;
    EmberStatus status = emberGetCertificate(&cert);

    // Check the status of the ECC library.
    if ((emberGetLibraryStatus(EMBER_ECC_LIBRARY_ID)
         & EMBER_LIBRARY_PRESENT_MASK) != 0U) {
      sl_zigbee_core_debug_print("Real163k1ECC ");
    } else {
      sl_zigbee_core_debug_print("No163k1ECC ");
      securityGood = false;
    }

    // Status of EMBER_LIBRARY_NOT_PRESENT means the CBKE is not present
    // in the image and that no information is known about the certificate.
    if (status == EMBER_LIBRARY_NOT_PRESENT) {
      sl_zigbee_core_debug_print("No163k1Cbke UnknownCert ");
      securityGood = false;
    } else {
      sl_zigbee_core_debug_print("Real163k1Cbke ");

      // Status of EMBER_SUCCESS means the Cert is good.
      if (status == EMBER_SUCCESS) {
        sl_zigbee_core_debug_print("GoodCert");
      }
      // Status of EMBER_ERR_FATAL means the Cert failed.
      else if (status == EMBER_ERR_FATAL) {
        sl_zigbee_core_debug_print("BadCert");
        securityGood = false;
      } else {
        // MISRA requires ..else if.. to have a terminating else.
      }
    }
    sl_zigbee_core_debug_print("]\n");
  }
  emberAfAppFlush();
  return securityGood;
#else
  return false;
#endif
}

static bool printSmartEnergySecurityInfo283k1(void)
{
#ifdef EMBER_AF_HAS_SECURITY_PROFILE_SE
  bool securityGood = true;
  sl_zigbee_core_debug_print("SE Security 283k1 Info [");
  {
    // For SE security, print the state of ECC, CBKE, and the programmed Cert.
    EmberCertificate283k1Data cert;
    // This is a temporary step until the EZSP frames are added
    // to the EZSP code.
    EmberStatus status = EMBER_LIBRARY_NOT_PRESENT;
    status = emberGetCertificate283k1(&cert);
    // Check the status of the ECC library.
    if ((emberGetLibraryStatus(EMBER_ECC_LIBRARY_283K1_ID)
         & EMBER_LIBRARY_PRESENT_MASK) != 0U) {
      sl_zigbee_core_debug_print("Real283k1ECC ");
    } else {
      sl_zigbee_core_debug_print("No283k1ECC ");
      securityGood = false;
    }

