espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/cli/core-cli.c
    // Status of EMBER_LIBRARY_NOT_PRESENT means the CBKE is not present
    // in the image and that no information is known about the certificate.
    if (status == EMBER_LIBRARY_NOT_PRESENT) {
      sl_zigbee_core_debug_print("No283k1Cbke UnknownCert");
      securityGood = false;
    } else {
      sl_zigbee_core_debug_print("Real283k1Cbke ");

      // Status of EMBER_SUCCESS means the Cert is good.
      if (status == EMBER_SUCCESS) {
        sl_zigbee_core_debug_print("GoodCert");
      }
      // Status of EMBER_ERR_FATAL means the Cert failed.
      else if (status == EMBER_ERR_FATAL) {
        sl_zigbee_core_debug_print("BadCert");
        securityGood = false;
      } else {
        // MISRA requires ..else if.. to have a terminating else.
      }
    }
    sl_zigbee_core_debug_print("]\n");
  }
  emberAfAppFlush();
  return securityGood;
#else
  return false;
#endif
}
#if defined(EMBER_TEST) && !defined(EZSP_HOST)
extern void blacklist_mask(uint32_t channel_mask);
void blackListCommand(sl_cli_command_arg_t *arguments)
{
  uint32_t channel_mask = sl_cli_get_argument_uint32(arguments, 0);
  blacklist_mask(channel_mask);
}
#endif

void emAfCliInfoCommand(sl_cli_command_arg_t *arguments)
{
  (void)arguments;

  EmberNodeType nodeTypeResult = 0xFF;
  EmberEUI64 myEui64;
  EmberNetworkParameters networkParams;
  uint8_t numPhyInterfaces;

  printMfgString();
  sl_zigbee_core_debug_print("AppBuilder MFG Code: 0x%04X\n", EMBER_AF_MANUFACTURER_CODE);
  emberAfGetEui64(myEui64);
  emberAfGetNetworkParameters(&nodeTypeResult, &networkParams);
  sl_zigbee_core_debug_print("node [");
  emberAfAppDebugExec(emberAfPrintBigEndianEui64(myEui64));
  emberAfAppFlush();
  sl_zigbee_core_debug_print("] chan [%d] pwr [%d]\n",
                             networkParams.radioChannel,
                             networkParams.radioTxPower);

  numPhyInterfaces = emberGetPhyInterfaceCount();

  if ((numPhyInterfaces > 1) && (255 != numPhyInterfaces)) {
    EmberMultiPhyRadioParameters multiPhyRadioParams;
    uint8_t i;
    EmberStatus status;

    sl_zigbee_core_debug_print("Additional interfaces\n");
    for (i = 1; i < numPhyInterfaces; ++i) {
      sl_zigbee_core_debug_print("  %d: ", i);
      status = emberGetRadioParameters(i, &multiPhyRadioParams);
      switch (status) {
        case EMBER_SUCCESS:
          sl_zigbee_core_debug_print("page [%d] chan [%d] pwr [%d]\n",
                                     multiPhyRadioParams.radioPage,
                                     multiPhyRadioParams.radioChannel,
                                     multiPhyRadioParams.radioTxPower);
          break;
        case EMBER_NETWORK_DOWN:
        case EMBER_NOT_JOINED:
          sl_zigbee_core_debug_print("not active\n");
          break;
        default:
          sl_zigbee_core_debug_print("error 0x%2X\n", status);
          break;
      }
    }
  }

  sl_zigbee_core_debug_print("panID [0x%04X] nodeID [0x%04X] ",
                             networkParams.panId,
                             emberAfGetNodeId());
  emberAfAppFlush();
  sl_zigbee_core_debug_print("xpan [0x");
  emberAfAppDebugExec(emberAfPrintBigEndianEui64(networkParams.extendedPanId));
  sl_zigbee_core_debug_print("]\n");
  emberAfAppFlush();

  #ifndef EZSP_HOST
  sl_zigbee_core_debug_print("parentID [0x%04X] parentRssi [%d]\n", emberGetParentId(), emberGetAvgParentRssi());
  emberAfAppFlush();
  #endif // EZSP_HOST

  emAfCliVersionCommand();

  sl_zigbee_core_debug_print("nodeType [");
  if (nodeTypeResult != 0xFF) {
    sl_zigbee_core_debug_print("0x%02X", nodeTypeResult);
  } else {
    sl_zigbee_core_debug_print("unknown");
  }
  sl_zigbee_core_debug_print("]\n");
  emberAfAppFlush();

  sl_zigbee_core_debug_print("Security level [%x]\n", emberAfGetSecurityLevel());

  printSmartEnergySecurityInfo();
  printSmartEnergySecurityInfo283k1();

  sl_zigbee_core_debug_print("network state [%02X] ", emberNetworkState());
  printPacketBuffers();

  // EMZIGBEE-5125: apps with lots of endpoints will wdog while printing
  halResetWatchdog();
  // Print the endpoint information.
  {
    uint8_t i, j;
    sl_zigbee_core_debug_print("Ep cnt: %d\n", emberAfEndpointCount());
    // Loop for each endpoint.
    for (i = 0; i < emberAfEndpointCount(); i++) {
      EmberAfEndpointType *et = emAfEndpoints[i].endpointType;
      sl_zigbee_core_debug_print("ep %d [endpoint %s, device %s] ",
                                 emberAfEndpointFromIndex(i),
                                 (emberAfEndpointIndexIsEnabled(i)
                                  ? "enabled"
                                  : "disabled"),
                                 (emberAfIsDeviceEnabled(emberAfEndpointFromIndex(i))
                                  ? "enabled"
                                  : "disabled"));
      sl_zigbee_core_debug_print("nwk [%d] profile [0x%04X] devId [0x%04X] ver [0x%x]\n",
                                 emberAfNetworkIndexFromEndpointIndex(i),
                                 emberAfProfileIdFromIndex(i),
                                 emberAfDeviceIdFromIndex(i),
                                 emberAfDeviceVersionFromIndex(i));
      // Loop for the clusters within the endpoint.
      for (j = 0; j < et->clusterCount; j++) {
        EmberAfCluster *zc = &(et->cluster[j]);
        sl_zigbee_core_debug_print("    %s cluster: 0x%04X ",
                                   (emberAfClusterIsClient(zc)
                                    ? "out(client)"
                                    : "in (server)"),
                                   zc->clusterId);
        emberAfAppDebugExec(emberAfDecodeAndPrintClusterWithMfgCode(zc->clusterId, emAfGetManufacturerCodeForCluster(zc)));
        sl_zigbee_core_debug_print("\n");
        emberAfAppFlush();
      }
      emberAfAppFlush();
      // EMZIGBEE-5125
      halResetWatchdog();
    }
    // EMZIGBEE-5125
    halResetWatchdog();
  }

  {
    const char * names[] = {
      EM_AF_GENERATED_NETWORK_STRINGS
    };
    uint8_t i;
    sl_zigbee_core_debug_print("Nwk cnt: %d\n", EMBER_SUPPORTED_NETWORKS);
    for (i = 0; i < EMBER_SUPPORTED_NETWORKS; i++) {
      emberAfPushNetworkIndex(i);
      sl_zigbee_core_debug_print("nwk %d [%s]\n", i, names[i]);
      if (emAfProIsCurrentNetwork()) {
        sl_zigbee_core_debug_print("  nodeType [0x%02X]\n",
                                   emAfCurrentZigbeeProNetwork->nodeType);
        sl_zigbee_core_debug_print("  securityProfile [0x%02X]\n",
                                   emAfCurrentZigbeeProNetwork->securityProfile);
      }
      emberAfPopNetworkIndex();
    }
  }
}

