espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/cli/core-cli.c
void sli_zigbee_cli_version_command(sl_cli_command_arg_t *arguments)
{
  (void)arguments;

  // Print the Version
  emAfCliVersionCommand();
}

void resetCommand(sl_cli_command_arg_t *arguments)
{
  halReboot();
}

void endpointPrint(sl_cli_command_arg_t *arguments)
{
  (void)arguments;
  uint8_t i;
  for (i = 0; i < emberAfEndpointCount(); i++) {
    sl_zigbee_core_debug_print("EP %d: %s ",
                               emAfEndpoints[i].endpoint,
                               (emberAfEndpointIndexIsEnabled(i)
                                ? "Enabled"
                                : "Disabled"));
    emAfPrintEzspEndpointFlags(emAfEndpoints[i].endpoint);
    sl_zigbee_core_debug_print("\n");
  }
}

void enableDisableEndpoint(sl_cli_command_arg_t *arguments)
{
  uint8_t endpoint = (uint8_t)sl_cli_get_argument_uint32(arguments, 0);
  bool enable = (sl_cli_get_command_string(arguments, 1)[0] == 'e'
                 ? true
                 : false);
  if (!emberAfEndpointEnableDisable(endpoint,
                                    enable)) {
    sl_zigbee_core_debug_print("Error:  Unknown endpoint.\n");
  }
}

#if SL_ZIGBEE_EVENT_DEBUG_ENABLED
#ifndef EVENT_QUEUE_LIST_END
#define EVENT_QUEUE_LIST_END ((EmberEvent *) 1)
#endif
#endif

void printEvents(sl_cli_command_arg_t *arguments)
{
  (void)arguments;
#if SL_ZIGBEE_EVENT_DEBUG_ENABLED

  EmberEvent *finger = emAppEventQueue.events;

  while (finger != EVENT_QUEUE_LIST_END) {
    sl_zigbee_core_debug_print("Event %s : ", (finger->actions.name == NULL
                                               ? "?"
                                               : finger->actions.name));
    // Get NWK Index
    if (sli_zigbee_event_is_network_event(finger)) {
      sl_zigbee_core_debug_print("NWK %d : ", sli_zigbee_event_get_network_index(finger));
    }

    // Get Endpoint
    if (sli_zigbee_event_is_endpoint_event(finger)) {
      sl_zigbee_core_debug_print("EP %d : ", sli_zigbee_event_get_endpoint(finger));
    }

    // Get Remaining Time
    sl_zigbee_core_debug_print("%d ms\n", sl_zigbee_event_get_remaining_ms(finger));
    finger = finger->next;
  }
#else
  sl_zigbee_core_debug_print("Enable event debug info in Core CLI component");
#endif // SL_ZIGBEE_EVENT_DEBUG_ENABLED
}

#else // !UC_BUILD

// Common include files:
#include "app/framework/util/common.h"
#include "app/framework/util/af-main.h"

#include "app/util/serial/sl_zigbee_command_interpreter.h"
#include "stack/include/library.h"
#include "app/framework/security/af-security.h"

#if !defined(EZSP_HOST)
  #include "stack/include/cbke-crypto-engine.h"  // emberGetCertificate()
  #include "stack/include/child.h"
#endif

#include "app/framework/cli/core-cli.h"
#include "app/framework/cli/custom-cli.h"
#include "app/framework/cli/network-cli.h"
#include "app/framework/cli/plugin-cli.h"
#include "app/framework/cli/security-cli.h"
#include "app/framework/cli/zdo-cli.h"
#include "app/framework/cli/option-cli.h"
#include "app/framework/plugin/test-harness/test-harness-cli.h"
#if defined(EMBER_AF_PLUGIN_COUNTERS)
  #include "app/framework/plugin/counters/counters-cli.h"
  #include "app/framework/plugin/counters/counters.h"
#endif

#include "app/framework/util/af-event.h"

#include "app/util/common/library.h"

//------------------------------------------------------------------------------

void emberCommandActionHandler(const CommandAction action)
{
  (void) emberAfPushNetworkIndex(emAfCliNetworkIndex);
  (*action)();
  (void) emberAfPopNetworkIndex();

#if defined(EMBER_QA)
  (void) emberSerialPrintfLine(APP_SERIAL, "CLI Finished");
#endif
}

extern EmberCommandEntry cbkeCommands[];

#if !defined(ZA_CLI_FULL) && !defined(EMBER_AF_GENERATE_CLI)
// Define this to satisfy external references.
EmberCommandEntry emberCommandTable[] = { { NULL } };
#endif

#if defined(ZA_CLI_FULL)

void printMfgString(void)
{
  uint8_t mfgString[MFG_STRING_MAX_LENGTH + 1];
  emberAfFormatMfgString(mfgString);

  // Note: We use '%s' here because this is a RAM string. Normally,
  // most strings are literals or constants in flash and use '%p'.
  emberAfAppPrintln("MFG String: %s", mfgString);
}

static void printPacketBuffers(void)
{
  emberAfAppPrintln("Buffs: %d / %d",
                    emAfGetPacketBufferFreeCount(),
                    emAfGetPacketBufferTotalCount());
}

bool printSmartEnergySecurityInfo(void)
{
#ifdef EMBER_AF_HAS_SECURITY_PROFILE_SE
  bool securityGood = true;
  emberAfAppPrint("SE Security Info [");
  {
    // For SE security, print the state of ECC, CBKE, and the programmed Cert.
    EmberCertificateData cert;
    EmberStatus status = emberGetCertificate(&cert);

    // Check the status of the ECC library.
    if ((emberGetLibraryStatus(EMBER_ECC_LIBRARY_ID)
         & EMBER_LIBRARY_PRESENT_MASK) != 0U) {
      emberAfAppPrint("Real163k1ECC ");
    } else {
      emberAfAppPrint("No163k1ECC ");
      securityGood = false;
    }

    // Status of EMBER_LIBRARY_NOT_PRESENT means the CBKE is not present
    // in the image and that no information is known about the certificate.
    if (status == EMBER_LIBRARY_NOT_PRESENT) {
      emberAfAppPrint("No163k1Cbke UnknownCert ");
      securityGood = false;
    } else {
      emberAfAppPrint("Real163k1Cbke ");

      // Status of EMBER_SUCCESS means the Cert is good.
      if (status == EMBER_SUCCESS) {
        emberAfAppPrint("GoodCert");
      }
      // Status of EMBER_ERR_FATAL means the Cert failed.
      else if (status == EMBER_ERR_FATAL) {
        emberAfAppPrint("BadCert");
        securityGood = false;
      } else {
        // MISRA requires ..else if.. to have a terminating else.
      }
    }
    emberAfAppPrintln("]");
  }
  emberAfAppFlush();
  return securityGood;
#else
  return false;
#endif
}

bool printSmartEnergySecurityInfo283k1(void)
{
#ifdef EMBER_AF_HAS_SECURITY_PROFILE_SE
  bool securityGood = true;
  emberAfAppPrint("SE Security 283k1 Info [");
  {
    // For SE security, print the state of ECC, CBKE, and the programmed Cert.
    EmberCertificate283k1Data cert;
    // This is a temporary step until the EZSP frames are added
    // to the EZSP code.
    EmberStatus status = EMBER_LIBRARY_NOT_PRESENT;
    status = emberGetCertificate283k1(&cert);
    // Check the status of the ECC library.
    if ((emberGetLibraryStatus(EMBER_ECC_LIBRARY_283K1_ID)
         & EMBER_LIBRARY_PRESENT_MASK) != 0U) {
      emberAfAppPrint("Real283k1ECC ");
    } else {
      emberAfAppPrint("No283k1ECC ");
      securityGood = false;
    }

